apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
/****************************************************************************
 * arch/arm/src/stm32h5/stm32_usbdrdhost.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/clock.h>
#include <nuttx/signal.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/usb/usb.h>

#include <arch/barriers.h>
#include <nuttx/usb/usbhost.h>
#include <nuttx/usb/usbhost_devaddr.h>
#include <nuttx/usb/usbhost_trace.h>

#include <nuttx/irq.h>

#include "chip.h"
#include <arch/board/board.h>

#include "arm_internal.h"
#include "stm32_gpio.h"
#include "stm32_rcc.h"
#include "hardware/stm32_pinmap.h"
#include "hardware/stm32_usbfs.h"
#include "hardware/stm32_rcc.h"
#include "hardware/stm32h5xxx_pwr.h"
#include "stm32_usbdrdhost.h"

#if defined(CONFIG_USBHOST) && defined(CONFIG_STM32_USBFS_HOST)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration */

#ifndef CONFIG_STM32_USBDRD_NCHANNELS
#  define CONFIG_STM32_USBDRD_NCHANNELS 8
#endif

#ifndef CONFIG_STM32_USBDRD_DESCSIZE
#  define CONFIG_STM32_USBDRD_DESCSIZE 128
#endif

#ifndef CONFIG_STM32_USBDRD_TRANSFER_TIMEOUT
#  define CONFIG_STM32_USBDRD_TRANSFER_TIMEOUT 5000
#endif

/* Hardware definitions */

#define STM32_NHOST_CHANNELS    CONFIG_STM32_USBDRD_NCHANNELS
#define STM32_EP0_MAX_PACKET_SIZE 64
#define STM32_RETRY_COUNT       3   /* Control transfer retries */

/* PMA Buffer allocation (fixed-size bitmap allocator) */

#define STM32_PMA_BUFFER_SIZE        64          /* Fixed buffer size (bytes) */
#define STM32_PMA_NBUFFERS           30          /* Total allocatable buffers */
#define STM32_PMA_BUFFER_ALLSET      0x3fffffff  /* All 30 buffers available */
#define STM32_PMA_BUFFER_BIT(bn)     (1U << (bn))
#define STM32_PMA_BUFNO2ADDR(bn)     (USB_DRD_PMA_START_ADDR + ((bn) * STM32_PMA_BUFFER_SIZE))
#define STM32_PMA_BUFFER_NONE        0xFF   /* Invalid buffer number */

/* Delays */

#define STM32_DATANAK_DELAY     SEC2TICK(5)
#define STM32_RESET_DELAY       100 /* ms */

/* USB DRD base addresses */

#define STM32_USBDRD_BASE       STM32_USB_FS_BASE
#define STM32_USBDRD_PMA_BASE   STM32_USB_FS_RAM_BASE

/* Register access helpers */

#define stm32_getreg(addr)      getreg32(addr)
#define stm32_putreg(addr, val) putreg32(val, addr)
#define stm32_modifyreg(addr, clearbits, setbits) modifyreg32(addr, clearbits, setbits)

/* Channel register access */

#define STM32_USB_CHEP(n)       (STM32_USBDRD_BASE + ((n) << 2))

/* Host channel data PID values */

#define HC_PID_DATA0                   (0)
#define HC_PID_DATA1                   (1)
#define HC_PID_DATA2                   (2)
#define HC_PID_SETUP                   (3)

/* Host channel direction */

#define CH_OUT_DIR                     (0)
#define CH_IN_DIR                      (1)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* USB host state machine states */

enum stm32_smstate_e
{
  SMSTATE_DETACHED = 0,  /* Not attached to a device */
  SMSTATE_ATTACHED,      /* Attached to a device */
  SMSTATE_ENUM,          /* Attached, enumerating */
  SMSTATE_CLASS_BOUND,   /* Enumeration complete, class bound */
};

/* Channel halt reason */

enum stm32_chreason_e
{
  CHREASON_IDLE = 0,     /* Inactive */
  CHREASON_FREED,        /* Channel no longer in use */
  CHREASON_XFRC,         /* Transfer complete */
  CHREASON_NAK,          /* NAK received */
  CHREASON_STALL,        /* Endpoint stalled */
  CHREASON_TXERR,        /* Transfer error */
  CHREASON_DTERR,        /* Data toggle error */
  CHREASON_CANCELLED     /* Transfer cancelled */
};

/* Host channel state */

struct stm32_chan_s
{
  sem_t             waitsem;   /* Channel wait semaphore */
  volatile uint8_t  result;    /* Transfer result */
  volatile uint8_t  chreason;  /* Halt reason */
  uint8_t           chidx;     /* Channel index */
  uint8_t           epno;      /* Device endpoint number */
  uint8_t           eptype;    /* Endpoint type */
  uint8_t           funcaddr;  /* Device function address */
  uint8_t           speed;     /* Device speed */
  uint8_t           interval;  /* Polling interval */
  uint8_t           pid;       /* Data PID */
  bool              inuse;     /* Channel in use */
  volatile bool     indata1;   /* IN data toggle */
  volatile bool     outdata1;  /* OUT data toggle */
  bool              in;        /* IN endpoint */
  volatile bool     waiter;    /* Thread waiting */
  uint16_t          maxpacket; /* Max packet size */
  uint16_t          buflen;    /* Buffer length */
  volatile uint16_t xfrd;      /* Bytes transferred */
  uint16_t          pmaaddr;   /* PMA buffer address */
  uint8_t           pmabufno;  /* PMA buffer number (0xFF = none) */
  uint8_t          *buffer;    /* Transfer buffer */
  usbhost_asynch_t  callback;  /* Async callback */
  void             *arg;       /* Callback argument */
};

/* Control endpoint info */

struct stm32_ctrlinfo_s
{
  uint8_t           inndx;     /* EP0 IN channel index */
  uint8_t           outndx;    /* EP0 OUT channel index */
};

/* USB host driver state */

struct stm32_usbhost_s
{
  /* NuttX driver interface - MUST be first */

  struct usbhost_driver_s drvr;

  /* Root hub port description */

  struct usbhost_roothubport_s rhport;

  /* Driver status */

