apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
  volatile uint8_t  smstate;   /* State machine state */
  uint8_t           chidx;     /* Channel waiting for TX */
  volatile bool     connected; /* Device connected */
  volatile bool     change;    /* Connection change */
  volatile bool     pscwait;   /* Waiting for port event */
  mutex_t           lock;      /* Access mutex */
  sem_t             pscsem;    /* Port status change sem */
  struct stm32_ctrlinfo_s ep0; /* EP0 description */

#ifdef CONFIG_USBHOST_HUB
  /* Used to pass external hub port events */

  volatile struct usbhost_hubport_s *hport;
#endif

  struct usbhost_devaddr_s devgen;  /* Address generation data */

  /* Host channels */

  struct stm32_chan_s chan[STM32_NHOST_CHANNELS];

  /* PMA allocation */

  uint32_t          pma_bufavail;  /* Bitmap of available PMA buffers */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Data conversion helpers */

static inline uint16_t stm32_getle16(const uint8_t *val);

/* PMA buffer management */

static void stm32_pma_write(const uint8_t *buffer, uint16_t pmaaddr,
                               uint16_t nbytes);
static void stm32_pma_read(uint8_t *buffer, uint16_t pmaaddr,
                              uint16_t nbytes);
static int stm32_pma_alloc_buffer(struct stm32_usbhost_s *priv);
static void stm32_pma_free_buffer(struct stm32_usbhost_s *priv,
                                   uint8_t bufno);

/* Channel management */

static int stm32_chan_alloc(struct stm32_usbhost_s *priv);
static inline void stm32_chan_free(struct stm32_usbhost_s *priv,
                                      int chidx);
static inline void stm32_chan_freeall(struct stm32_usbhost_s *priv);
static void stm32_chan_configure(struct stm32_usbhost_s *priv,
                                    int chidx);
static int stm32_chan_waitsetup(struct stm32_usbhost_s *priv,
                                   struct stm32_chan_s *chan);
static int stm32_chan_wait(struct stm32_usbhost_s *priv,
                              struct stm32_chan_s *chan,
                              int timeout_ms);
static void stm32_chan_wakeup(struct stm32_usbhost_s *priv,
                                 struct stm32_chan_s *chan);
static void stm32_set_chep_rx_status(struct stm32_usbhost_s *priv,
                                     int chidx, uint32_t status);
static void stm32_set_chep_tx_status(struct stm32_usbhost_s *priv,
                                     int chidx, uint32_t status);

/* Control endpoint helpers */

static int stm32_ctrlchan_alloc(struct stm32_usbhost_s *priv,
                                   uint8_t epno, uint8_t funcaddr,
                                   uint8_t speed,
                                   struct stm32_ctrlinfo_s *ctrlep);
static int stm32_ctrlep_alloc(struct stm32_usbhost_s *priv,
                                 const struct usbhost_epdesc_s *epdesc,
                                 usbhost_ep_t *ep);
static int stm32_xfrep_alloc(struct stm32_usbhost_s *priv,
                                const struct usbhost_epdesc_s *epdesc,
                                usbhost_ep_t *ep);

/* Transfer functions */

static void stm32_transfer_start(struct stm32_usbhost_s *priv,
                                    int chidx);
static int stm32_ctrl_sendsetup(struct stm32_usbhost_s *priv,
                                   struct stm32_ctrlinfo_s *ep0,
                                   const struct usb_ctrlreq_s *req);
static int stm32_ctrl_senddata(struct stm32_usbhost_s *priv,
                                  struct stm32_ctrlinfo_s *ep0,
                                  uint8_t *buffer, unsigned int buflen);
static int stm32_ctrl_recvdata(struct stm32_usbhost_s *priv,
                                  struct stm32_ctrlinfo_s *ep0,
                                  uint8_t *buffer, unsigned int buflen);
static ssize_t stm32_in_transfer(struct stm32_usbhost_s *priv,
                                    int chidx, uint8_t *buffer,
                                    size_t buflen);
static ssize_t stm32_out_transfer(struct stm32_usbhost_s *priv,
                                     int chidx, uint8_t *buffer,
                                     size_t buflen);

/* Interrupt handling */

static void stm32_hc_in_irq(struct stm32_usbhost_s *priv, int chidx);
static void stm32_hc_out_irq(struct stm32_usbhost_s *priv, int chidx);
static int stm32_usbdrd_interrupt(int irq, void *context, void *arg);
static void stm32_gint_connected(struct stm32_usbhost_s *priv);
static void stm32_gint_disconnected(struct stm32_usbhost_s *priv);

/* USB host driver interface */

static int stm32_wait(struct usbhost_connection_s *conn,
                         struct usbhost_hubport_s **hport);
static int stm32_rh_enumerate(struct stm32_usbhost_s *priv,
                                 struct usbhost_connection_s *conn,
                                 struct usbhost_hubport_s *hport);
static int stm32_enumerate(struct usbhost_connection_s *conn,
                              struct usbhost_hubport_s *hport);

static int stm32_ep0configure(struct usbhost_driver_s *drvr,
                                 usbhost_ep_t ep0, uint8_t funcaddr,
                                 uint8_t speed, uint16_t maxpacketsize);
static int stm32_epalloc(struct usbhost_driver_s *drvr,
                            const struct usbhost_epdesc_s *epdesc,
                            usbhost_ep_t *ep);
static int stm32_epfree(struct usbhost_driver_s *drvr, usbhost_ep_t ep);
static int stm32_alloc(struct usbhost_driver_s *drvr,
                          uint8_t **buffer, size_t *maxlen);
static int stm32_free(struct usbhost_driver_s *drvr, uint8_t *buffer);
static int stm32_ioalloc(struct usbhost_driver_s *drvr,
                            uint8_t **buffer, size_t buflen);
static int stm32_iofree(struct usbhost_driver_s *drvr, uint8_t *buffer);
static int stm32_ctrlin(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                           const struct usb_ctrlreq_s *req, uint8_t *buffer);
static int stm32_ctrlout(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                            const struct usb_ctrlreq_s *req,
                            const uint8_t *buffer);
static ssize_t stm32_transfer(struct usbhost_driver_s *drvr,
                                 usbhost_ep_t ep, uint8_t *buffer,
                                 size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static int stm32_asynch(struct usbhost_driver_s *drvr, usbhost_ep_t ep,
                           uint8_t *buffer, size_t buflen,
                           usbhost_asynch_t callback, void *arg);
#endif
static int stm32_cancel(struct usbhost_driver_s *drvr, usbhost_ep_t ep);
#ifdef CONFIG_USBHOST_HUB
static int stm32_connect(struct usbhost_driver_s *drvr,
                            struct usbhost_hubport_s *hport, bool connected);
#endif
static void stm32_disconnect(struct usbhost_driver_s *drvr,
                                struct usbhost_hubport_s *hport);

/* Initialization */

static void stm32_portreset(struct stm32_usbhost_s *priv);
static void stm32_host_initialize(struct stm32_usbhost_s *priv);
static void stm32_sw_initialize(struct stm32_usbhost_s *priv);
static int stm32_hw_initialize(struct stm32_usbhost_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

