apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
/* Single USB host instance */

static struct stm32_usbhost_s g_usbhost =
{
  .lock = NXMUTEX_INITIALIZER,
  .pscsem = SEM_INITIALIZER(0),
};

/* Connection/enumeration interface */

static struct usbhost_connection_s g_usbconn =
{
  .wait      = stm32_wait,
  .enumerate = stm32_enumerate,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_getle16
 *
 * Description:
 *   Get a 16-bit value from a little-endian byte stream
 *
 ****************************************************************************/

static inline uint16_t stm32_getle16(const uint8_t *val)
{
  return (uint16_t)val[1] << 8 | (uint16_t)val[0];
}

/****************************************************************************
 * Name: stm32_pma_write
 *
 * Description:
 *   Write data to the Packet Memory Area (PMA)
 *
 ****************************************************************************/

static void stm32_pma_write(const uint8_t *buffer, uint16_t pmaaddr,
                               uint16_t nbytes)
{
  volatile uint32_t *pdwval;
  uint32_t count;
  uint32_t remaining;

  pdwval = (volatile uint32_t *)(STM32_USBDRD_PMA_BASE + pmaaddr);
  count = nbytes >> 2;          /* Number of 32-bit words */
  remaining = nbytes & 0x03;    /* Remaining bytes */

  /* Write full 32-bit words */

  while (count > 0)
    {
      *pdwval++ = (uint32_t)buffer[0] |
                  ((uint32_t)buffer[1] << 8) |
                  ((uint32_t)buffer[2] << 16) |
                  ((uint32_t)buffer[3] << 24);
      buffer += 4;
      count--;
    }

  /* Write remaining bytes */

  if (remaining > 0)
    {
      uint32_t val = 0;
      for (uint32_t i = 0; i < remaining; i++)
        {
          val |= ((uint32_t)buffer[i] << (8 * i));
        }

      *pdwval = val;
    }
}

/****************************************************************************
 * Name: stm32_pma_read
 *
 * Description:
 *   Read data from the Packet Memory Area (PMA)
 *
 ****************************************************************************/

static void stm32_pma_read(uint8_t *buffer, uint16_t pmaaddr,
                              uint16_t nbytes)
{
  volatile uint32_t *pdwval;
  uint32_t count;
  uint32_t remaining;
  uint32_t val;

  /* Memory barrier to ensure USB peripheral writes are visible to CPU */

  UP_DSB();

  pdwval = (volatile uint32_t *)(STM32_USBDRD_PMA_BASE + pmaaddr);
  count = nbytes >> 2;
  remaining = nbytes & 0x03;

  /* Read full 32-bit words */

  while (count > 0)
    {
      *(uint32_t *)buffer = *pdwval++;
      buffer += 4;
      count--;
    }

  /* Read remaining bytes */

  if (remaining > 0)
    {
      val = *pdwval;
      for (uint32_t i = 0; i < remaining; i++)
        {
          *buffer++ = (uint8_t)((val >> (8 * i)) & 0xff);
        }
    }
}

/****************************************************************************
 * Name: stm32_pma_alloc_buffer
 *
 * Description:
 *   Allocate a PMA buffer using bitmap allocation. Returns buffer number
 *   on success, negative error code on failure.
 *
 ****************************************************************************/

static int stm32_pma_alloc_buffer(struct stm32_usbhost_s *priv)
{
  irqstate_t flags;
  int bufno = -ENOMEM;
  int bufndx;

  flags = enter_critical_section();

  for (bufndx = 0; bufndx < STM32_PMA_NBUFFERS; bufndx++)
    {
      uint32_t bit = STM32_PMA_BUFFER_BIT(bufndx);
      if ((priv->pma_bufavail & bit) != 0)
        {
          priv->pma_bufavail &= ~bit;  /* Mark allocated */
          bufno = bufndx;
          break;
        }
    }

  leave_critical_section(flags);

  if (bufno >= 0)
    {
      uinfo("PMA buffer allocated: bufno=%d addr=0x%04x\n",
            bufno, STM32_PMA_BUFNO2ADDR(bufno));
    }
  else
    {
      uerr("ERROR: PMA buffer allocation failed, all %d buffers in use\n",
           STM32_PMA_NBUFFERS);
    }

  return bufno;
}

/****************************************************************************
 * Name: stm32_pma_free_buffer
 *
 * Description:
 *   Free a PMA buffer by buffer number.
 *
 ****************************************************************************/

static void stm32_pma_free_buffer(struct stm32_usbhost_s *priv,
                                   uint8_t bufno)
{
  irqstate_t flags;

  DEBUGASSERT(bufno < STM32_PMA_NBUFFERS);

  flags = enter_critical_section();
  priv->pma_bufavail |= STM32_PMA_BUFFER_BIT(bufno);  /* Mark available */
  leave_critical_section(flags);

  uinfo("PMA buffer freed: bufno=%d addr=0x%04x\n",
        bufno, STM32_PMA_BUFNO2ADDR(bufno));
}

/****************************************************************************
 * Name: stm32_chan_alloc
 *
 * Description:
 *   Allocate a host channel
 *
 ****************************************************************************/

static int stm32_chan_alloc(struct stm32_usbhost_s *priv)
{
  int chidx;

  for (chidx = 0; chidx < STM32_NHOST_CHANNELS; chidx++)
    {
      if (!priv->chan[chidx].inuse)
        {
          int bufno = stm32_pma_alloc_buffer(priv);
          if (bufno < 0)
            {
              return -ENOMEM;
            }

          priv->chan[chidx].inuse = true;
          priv->chan[chidx].pmabufno = (uint8_t)bufno;
          priv->chan[chidx].pmaaddr = STM32_PMA_BUFNO2ADDR(bufno);
          uinfo("Channel allocated: chidx=%d\n", chidx);
          return chidx;
        }
    }

  return -ENODEV;
}

/****************************************************************************
 * Name: stm32_chan_free
 *
 * Description:
 *   Free a host channel
 *
 ****************************************************************************/

static inline void stm32_chan_free(struct stm32_usbhost_s *priv,
                                      int chidx)
{
  struct stm32_chan_s *chan;

  DEBUGASSERT((unsigned)chidx < STM32_NHOST_CHANNELS);

  chan = &priv->chan[chidx];

  /* Free PMA buffer if allocated */

