apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
  if (chan->pmabufno != STM32_PMA_BUFFER_NONE)
    {
      stm32_set_chep_rx_status(priv, chidx, USB_CHEP_RX_STRX_DIS);
      stm32_set_chep_tx_status(priv, chidx, USB_CHEP_TX_STTX_DIS);
      stm32_pma_free_buffer(priv, chan->pmabufno);
      chan->pmabufno = STM32_PMA_BUFFER_NONE;
      chan->pmaaddr = 0;
      uinfo("Channel freed: chidx=%d\n", chidx);
    }

  chan->inuse = false;
}

/****************************************************************************
 * Name: stm32_set_chep_tx_status
 *
 * Description:
 *   Sets the status of a channel's TX endpoint by toggling the
 *   appropriate DTOG bits.
 *
 ****************************************************************************/

static void stm32_set_chep_tx_status(struct stm32_usbhost_s *priv,
                                     int chidx, uint32_t status)
{
  uint32_t regval;

  /* Status changes work by toggling the DTOG bits */

  regval = stm32_getreg(STM32_USB_CHEP(priv->chan[chidx].chidx))
                        & USB_CHEP_TX_DTOGMASK;
  if (status & USB_CHEP_TX_DTOG1)
    {
      regval ^= USB_CHEP_TX_DTOG1;
    }

  if (status & USB_CHEP_TX_DTOG2)
    {
      regval ^= USB_CHEP_TX_DTOG2;
    }

  stm32_putreg(STM32_USB_CHEP(priv->chan[chidx].chidx),
               regval | USB_CHEP_VTRX | USB_CHEP_VTTX);
}

/****************************************************************************
 * Name: stm32_set_chep_rx_status
 *
 * Description:
 *   Sets the status of a channel's RX endpoint
 *   by toggling the appropriate DTOG bits.
 *
 ****************************************************************************/

static void stm32_set_chep_rx_status(struct stm32_usbhost_s *priv,
                                     int chidx, uint32_t status)
{
  uint32_t regval;

  /* Status changes work by toggling the DTOG bits */

  regval = stm32_getreg(STM32_USB_CHEP(priv->chan[chidx].chidx))
                        & USB_CHEP_RX_DTOGMASK;
  if (status & USB_CHEP_RX_DTOG1)
    {
      regval ^= USB_CHEP_RX_DTOG1;
    }

  if (status & USB_CHEP_RX_DTOG2)
    {
      regval ^= USB_CHEP_RX_DTOG2;
    }

  stm32_putreg(STM32_USB_CHEP(priv->chan[chidx].chidx),
               regval | USB_CHEP_VTRX | USB_CHEP_VTTX);
}

/****************************************************************************
 * Name: stm32_chan_freeall
 *
 * Description:
 *   Free all channels.
 *
 ****************************************************************************/

static inline void stm32_chan_freeall(struct stm32_usbhost_s *priv)
{
  int chidx;

  /* Free all host channels */

  for (chidx = 0; chidx < STM32_NHOST_CHANNELS; chidx++)
    {
      if (priv->chan[chidx].inuse)
        {
          stm32_chan_free(priv, chidx);
        }
    }
}

/****************************************************************************
 * Name: stm32_chan_configure
 *
 * Description:
 *   Configure a host channel for a transfer
 *
 ****************************************************************************/

static void stm32_chan_configure(struct stm32_usbhost_s *priv,
                                    int chidx)
{
  struct stm32_chan_s *chan = &priv->chan[chidx];
  uint32_t regval;
  uint32_t eptype;

  /* Get endpoint type for register */

  switch (chan->eptype)
    {
      case USB_EP_ATTR_XFER_CONTROL:
        eptype = USB_CHEP_UTYPE_CTRL;
        break;
      case USB_EP_ATTR_XFER_BULK:
        eptype = USB_CHEP_UTYPE_BULK;
        break;
      case USB_EP_ATTR_XFER_INT:
        eptype = USB_CHEP_UTYPE_INTR;
        break;
      case USB_EP_ATTR_XFER_ISOC:
        eptype = USB_CHEP_UTYPE_ISOC;
        break;
      default:
        eptype = USB_CHEP_UTYPE_BULK;
        break;
    }

  /* Read current register value and mask toggleable bits */

  regval = stm32_getreg(STM32_USB_CHEP(chidx)) & USB_CH_T_MASK;

  /* Set endpoint type */

  regval |= eptype;

  /* Clear and set device address and endpoint number */

  regval &= ~(USB_CHEP_DEVADDR_MASK | USB_CHEP_ADDR_MASK |
              USB_CHEP_LSEP | USB_CHEP_NAK |
              USB_CHEP_KIND | USB_CHEP_ERRTX | USB_CHEP_ERRRX);

  regval |= ((uint32_t)chan->funcaddr << USB_CHEP_DEVADDR_SHIFT);
  regval |= ((uint32_t)chan->epno & 0x0f);

  /* Set low-speed endpoint flag if needed */

  if (chan->speed == USB_SPEED_LOW)
    {
      regval |= USB_CHEP_LSEP;
    }

  /* Write the channel register with VT bits preserved */

  stm32_putreg(STM32_USB_CHEP(chidx),
                 regval | USB_CHEP_VTRX | USB_CHEP_VTTX);
}

/****************************************************************************
 * Name: stm32_chan_waitsetup
 *
 * Description:
 *   Set up to wait for transfer completion
 *
 ****************************************************************************/

static int stm32_chan_waitsetup(struct stm32_usbhost_s *priv,
                                   struct stm32_chan_s *chan)
{
  irqstate_t flags = enter_critical_section();

  /* Is the device still connected? */

  if (!priv->connected)
    {
      leave_critical_section(flags);
      return -ENODEV;
    }

  chan->waiter = true;
  chan->callback = NULL;
  chan->result = EBUSY;

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: stm32_chan_wait
 *
 * Description:
 *   Wait for transfer completion
 *
 ****************************************************************************/

static int stm32_chan_wait(struct stm32_usbhost_s *priv,
                              struct stm32_chan_s *chan,
                              int timeout_ms)
{
  irqstate_t flags;
  int ret;

  struct timespec abstime;
  clock_gettime(CLOCK_MONOTONIC, &abstime);
  abstime.tv_sec += timeout_ms / 1000;
  abstime.tv_nsec += (timeout_ms % 1000) * 1000000;
  if (abstime.tv_nsec >= 1000000000)
    {
      abstime.tv_sec += 1;
      abstime.tv_nsec -= 1000000000;
    }

  flags = enter_critical_section();

  while (chan->waiter)
    {
      ret = nxsem_clockwait(&chan->waitsem, CLOCK_MONOTONIC, &abstime);
      if (ret < 0)
        {
          /* Cancel the transfer if still active */

          if (chan->in)
            {
              stm32_set_chep_rx_status(priv, chan->chidx,
                                       USB_CHEP_RX_STRX_STALL);
            }
          else
            {
              stm32_set_chep_tx_status(priv, chan->chidx,
                                       USB_CHEP_TX_STTX_STALL);
            }

          leave_critical_section(flags);
          return ret;
        }
    }

  ret = -(int)chan->result;
  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: stm32_chan_wakeup
 *
 * Description:
 *   Wake up a waiting thread
 *
 ****************************************************************************/

static void stm32_chan_wakeup(struct stm32_usbhost_s *priv,
                                 struct stm32_chan_s *chan)
{
  if (chan->waiter)
    {
      chan->waiter = false;
      nxsem_post(&chan->waitsem);
    }

