apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
#ifdef CONFIG_USBHOST_ASYNCH
  else if (chan->callback)
    {
      usbhost_asynch_t callback = chan->callback;
      void *arg = chan->arg;
      int nbytes = chan->xfrd;
      int result = chan->result;

      chan->callback = NULL;
      chan->arg = NULL;

      if (result != OK)
        {
          nbytes = -(int)result;
        }

      callback(arg, nbytes);
    }
  else
    {
      uerr("ERROR: No waiter or callback for channel %d\n", chan->chidx);
    }
#endif
}

/****************************************************************************
 * Name: stm32_ctrlchan_alloc
 *
 * Description:
 *   Allocate channels for control endpoint (IN and OUT)
 *
 ****************************************************************************/

static int stm32_ctrlchan_alloc(struct stm32_usbhost_s *priv,
                                   uint8_t epno, uint8_t funcaddr,
                                   uint8_t speed,
                                   struct stm32_ctrlinfo_s *ctrlep)
{
  struct stm32_chan_s *chan;
  int inndx;
  int outndx;

  /* Allocate IN channel */

  inndx = stm32_chan_alloc(priv);
  if (inndx < 0)
    {
      return -ENOMEM;
    }

  /* Allocate OUT channel */

  outndx = stm32_chan_alloc(priv);
  if (outndx < 0)
    {
      stm32_chan_free(priv, inndx);
      return -ENOMEM;
    }

  /* Configure IN channel */

  chan = &priv->chan[inndx];
  chan->epno = epno;
  chan->in = true;
  chan->eptype = USB_EP_ATTR_XFER_CONTROL;
  chan->funcaddr = funcaddr;
  chan->speed = speed;
  chan->maxpacket = STM32_EP0_MAX_PACKET_SIZE;
  chan->indata1 = false;
  chan->outdata1 = false;

  /* Configure OUT channel */

  chan = &priv->chan[outndx];
  chan->epno = epno;
  chan->in = false;
  chan->eptype = USB_EP_ATTR_XFER_CONTROL;
  chan->funcaddr = funcaddr;
  chan->speed = speed;
  chan->maxpacket = STM32_EP0_MAX_PACKET_SIZE;
  chan->indata1 = false;
  chan->outdata1 = false;

  /* Configure channels */

  stm32_chan_configure(priv, inndx);
  stm32_chan_configure(priv, outndx);

  ctrlep->inndx = inndx;
  ctrlep->outndx = outndx;

  return OK;
}

/****************************************************************************
 * Name: stm32_ctrlep_alloc
 *
 * Description:
 *   Allocate a control endpoint
 *
 ****************************************************************************/

static int stm32_ctrlep_alloc(struct stm32_usbhost_s *priv,
                                 const struct usbhost_epdesc_s *epdesc,
                                 usbhost_ep_t *ep)
{
  struct stm32_ctrlinfo_s *ctrlep;
  int ret;

  ctrlep = kmm_malloc(sizeof(struct stm32_ctrlinfo_s));
  if (!ctrlep)
    {
      return -ENOMEM;
    }

  ret = stm32_ctrlchan_alloc(priv, 0, epdesc->hport->funcaddr,
                                epdesc->hport->speed, ctrlep);
  if (ret < 0)
    {
      kmm_free(ctrlep);
      return ret;
    }

  *ep = (usbhost_ep_t)ctrlep;
  return OK;
}

/****************************************************************************
 * Name: stm32_xfrep_alloc
 *
 * Description:
 *   Allocate a bulk/interrupt endpoint
 *
 ****************************************************************************/

static int stm32_xfrep_alloc(struct stm32_usbhost_s *priv,
                                const struct usbhost_epdesc_s *epdesc,
                                usbhost_ep_t *ep)
{
  struct stm32_chan_s *chan;
  int chidx;

  chidx = stm32_chan_alloc(priv);
  if (chidx < 0)
    {
      return -ENOMEM;
    }

  chan = &priv->chan[chidx];
  chan->epno = epdesc->addr & USB_EPNO_MASK;
  chan->in = epdesc->in;
  chan->eptype = epdesc->xfrtype;
  chan->funcaddr = epdesc->hport->funcaddr;
  chan->speed = epdesc->hport->speed;
  chan->interval = epdesc->interval;
  chan->maxpacket = epdesc->mxpacketsize;
  chan->indata1 = false;
  chan->outdata1 = false;

  /* Clamp all endpoints to max 64 bytes. To support larger packets,
   * additional PMA logic is required
   */

  if (chan->maxpacket > 64)
    {
      chan->maxpacket = 64;
    }

  stm32_chan_configure(priv, chidx);

  *ep = (usbhost_ep_t)chidx;
  return OK;
}

/****************************************************************************
 * Name: stm32_transfer_start
 *
 * Description:
 *   Start a USB transfer
 *
 ****************************************************************************/

static void stm32_transfer_start(struct stm32_usbhost_s *priv,
                                    int chidx)
{
  struct stm32_chan_s *chan = &priv->chan[chidx];
  uint32_t regval;
  uint16_t len;
  uint32_t bdval;
  volatile uint32_t *pbd;

  len = chan->buflen > chan->maxpacket ? chan->maxpacket : chan->buflen;

  if (chan->in)
    {
      /* Set up RX buffer in PMA */

      bdval = chan->pmaaddr;  /* chan->pmaaddr is already 4 byte aligned */

      if (len > 62)
        {
          /* BL_SIZE = 1, NUM_BLOCK = (len / 32) - 1 */

          uint32_t nblocks = ((len + 31) / 32);
          bdval |= USB_PMA_RXBD_BLSIZE |
                   ((nblocks - 1) << USB_PMA_RXBD_NUM_BLOCK_SHIFT);
        }
      else
        {
          /* BL_SIZE = 0, NUM_BLOCK = len / 2 */

          uint32_t nblocks = (len + 1) / 2;
          bdval |= (nblocks << USB_PMA_RXBD_NUM_BLOCK_SHIFT);
        }

      pbd = (volatile uint32_t *)(STM32_USBDRD_PMA_BASE +
                                  USB_PMA_RXBD_OFFSET(chidx));
      *pbd = bdval;

      /* Memory barrier to ensure BD write completes
       * before enabling transfer
       */

      UP_DSB();

      /* Clear data toggle if starting new transfer */

      regval = stm32_getreg(STM32_USB_CHEP(chidx));
      if ((regval & USB_CHEP_DTOG_RX) != 0)
        {
          if (!chan->indata1)
            {
              /* Need DATA0, but DTOG shows DATA1 - toggle it */

              regval = (regval & USB_CHEP_REG_MASK) |
                       USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_DTOG_RX;
              stm32_putreg(STM32_USB_CHEP(chidx), regval);
            }
        }
      else
        {
          if (chan->indata1)
            {
              /* Need DATA1, but DTOG shows DATA0 - toggle it */

              regval = (regval & USB_CHEP_REG_MASK) |
                       USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_DTOG_RX;
              stm32_putreg(STM32_USB_CHEP(chidx), regval);
            }
        }

      /* Enable RX */

      stm32_set_chep_rx_status(priv, chan->chidx, USB_CHEP_RX_STRX_VALID);
    }
  else
    {
      /* OUT transfer - write data to PMA and set TX count */

      if (len > 0)
        {
          stm32_pma_write(chan->buffer, chan->pmaaddr, len);
        }

      /* Update TX count in buffer descriptor */

      bdval = chan->pmaaddr;  /* chan->pmaaddr is already 4 byte aligned */
      bdval |= ((uint32_t)len << USB_PMA_TXBD_COUNT_SHIFT);

      pbd = (volatile uint32_t *)(STM32_USBDRD_PMA_BASE +
                                  USB_PMA_TXBD_OFFSET(chidx));
      *pbd = bdval;

      /* Handle SETUP token for control transfers */

      if (chan->pid == HC_PID_SETUP)
        {
          regval = stm32_getreg(STM32_USB_CHEP(chidx)) & USB_CHEP_REG_MASK;
          stm32_putreg(STM32_USB_CHEP(chidx),
                         regval | USB_CHEP_SETUP |
                         USB_CHEP_VTRX | USB_CHEP_VTTX);
        }

      /* Sync data toggle (only needed at transfer start,
       * hardware auto-toggles after successful transmit)
       */

      regval = stm32_getreg(STM32_USB_CHEP(chidx));
      if ((regval & USB_CHEP_DTOG_TX) != 0)
        {
          if (!chan->outdata1)
            {
              /* Need DATA0, toggle it */

              regval = (regval & USB_CHEP_REG_MASK) |
                       USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_DTOG_TX;
              stm32_putreg(STM32_USB_CHEP(chidx), regval);
            }
        }
      else
        {
          if (chan->outdata1)
            {
              /* Need DATA1, toggle it */

              regval = (regval & USB_CHEP_REG_MASK) |
                       USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_DTOG_TX;
              stm32_putreg(STM32_USB_CHEP(chidx), regval);
            }
        }

      /* Enable TX */

      stm32_set_chep_tx_status(priv, chan->chidx, USB_CHEP_TX_STTX_VALID);
    }
}

/****************************************************************************
 * Name: stm32_ctrl_sendsetup
 *
 * Description:
 *   Send a SETUP packet
 *
 ****************************************************************************/

static int stm32_ctrl_sendsetup(struct stm32_usbhost_s *priv,
                                   struct stm32_ctrlinfo_s *ep0,
                                   const struct usb_ctrlreq_s *req)
{
  struct stm32_chan_s *chan;
  int ret;

  chan = &priv->chan[ep0->outndx];

