apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
  /* Set up the transfer */

  chan->buffer = (uint8_t *)req;
  chan->buflen = USB_SIZEOF_CTRLREQ;
  chan->pid = HC_PID_SETUP;
  chan->outdata1 = false;

  ret = stm32_chan_waitsetup(priv, chan);
  if (ret < 0)
    {
      return ret;
    }

  stm32_transfer_start(priv, ep0->outndx);
  return stm32_chan_wait(priv, chan, CONFIG_STM32_USBDRD_TRANSFER_TIMEOUT);
}

/****************************************************************************
 * Name: stm32_ctrl_senddata
 *
 * Description:
 *   Send control data
 *
 ****************************************************************************/

static int stm32_ctrl_senddata(struct stm32_usbhost_s *priv,
                                  struct stm32_ctrlinfo_s *ep0,
                                  uint8_t *buffer, unsigned int buflen)
{
  struct stm32_chan_s *chan;
  int ret;

  chan = &priv->chan[ep0->outndx];

  chan->buffer = buffer;
  chan->buflen = buflen;
  chan->pid = HC_PID_DATA1;
  chan->outdata1 = true;

  ret = stm32_chan_waitsetup(priv, chan);
  if (ret < 0)
    {
      return ret;
    }

  stm32_transfer_start(priv, ep0->outndx);
  return stm32_chan_wait(priv, chan, CONFIG_STM32_USBDRD_TRANSFER_TIMEOUT);
}

/****************************************************************************
 * Name: stm32_ctrl_recvdata
 *
 * Description:
 *   Receive control data
 *
 ****************************************************************************/

static int stm32_ctrl_recvdata(struct stm32_usbhost_s *priv,
                                  struct stm32_ctrlinfo_s *ep0,
                                  uint8_t *buffer, unsigned int buflen)
{
  struct stm32_chan_s *chan;
  int ret;

  chan = &priv->chan[ep0->inndx];

  chan->buffer = buffer;
  chan->buflen = buflen;
  chan->pid = HC_PID_DATA1;
  chan->indata1 = true;

  ret = stm32_chan_waitsetup(priv, chan);
  if (ret < 0)
    {
      return ret;
    }

  stm32_transfer_start(priv, ep0->inndx);
  return stm32_chan_wait(priv, chan, CONFIG_STM32_USBDRD_TRANSFER_TIMEOUT);
}

/****************************************************************************
 * Name: stm32_in_transfer
 *
 * Description:
 *   Perform an IN transfer
 *
 ****************************************************************************/

static ssize_t stm32_in_transfer(struct stm32_usbhost_s *priv,
                                    int chidx, uint8_t *buffer,
                                    size_t buflen)
{
  struct stm32_chan_s *chan = &priv->chan[chidx];
  int ret;

  /* Set up for ENTIRE transfer (IRQ will handle multi-packet) */

  chan->buffer = buffer;
  chan->buflen = buflen;
  chan->xfrd = 0;

  ret = stm32_chan_waitsetup(priv, chan);
  if (ret < 0)
    {
      return ret;
    }

  stm32_transfer_start(priv, chidx);

  ret = stm32_chan_wait(priv, chan, CONFIG_STM32_USBDRD_TRANSFER_TIMEOUT);
  if (ret < 0)
    {
      return ret;
    }

  return chan->xfrd;
}

/****************************************************************************
 * Name: stm32_out_transfer
 *
 * Description:
 *   Perform an OUT transfer
 *
 ****************************************************************************/

static ssize_t stm32_out_transfer(struct stm32_usbhost_s *priv,
                                     int chidx, uint8_t *buffer,
                                     size_t buflen)
{
  struct stm32_chan_s *chan = &priv->chan[chidx];
  int ret;

  /* Set up for ENTIRE transfer (IRQ will handle multi-packet) */

  chan->buffer = buffer;
  chan->buflen = buflen;
  chan->xfrd = 0;

  ret = stm32_chan_waitsetup(priv, chan);
  if (ret < 0)
    {
      return ret;
    }

  stm32_transfer_start(priv, chidx);

  ret = stm32_chan_wait(priv, chan, CONFIG_STM32_USBDRD_TRANSFER_TIMEOUT);
  if (ret < 0)
    {
      return ret;
    }

  return chan->xfrd;
}

/****************************************************************************
 * Name: stm32_gint_connected
 *
 * Description:
 *   Handle device connection
 *
 ****************************************************************************/

static void stm32_gint_connected(struct stm32_usbhost_s *priv)
{
  /* Were we previously disconnected? */

  if (!priv->connected)
    {
      /* Yes.. then now we are connected */

      uinfo("USB device connected\n");
      priv->connected = true;
      priv->change    = true;
      DEBUGASSERT(priv->smstate == SMSTATE_DETACHED);

      /* Notify any waiters */

      priv->smstate = SMSTATE_ATTACHED;
      if (priv->pscwait)
        {
          nxsem_post(&priv->pscsem);
          priv->pscwait = false;
        }
    }
}

/****************************************************************************
 * Name: stm32_gint_disconnected
 *
 * Description:
 *   Handle device disconnection
 *
 ****************************************************************************/

static void stm32_gint_disconnected(struct stm32_usbhost_s *priv)
{
  /* Were we previously connected? */

  if (priv->connected)
    {
      /* Yes.. then we no longer connected */

      uinfo("USB device disconnected\n");

      /* Are we bound to a class driver? */

      if (priv->rhport.hport.devclass)
        {
          /* Yes.. Disconnect the class driver */

          CLASS_DISCONNECTED(priv->rhport.hport.devclass);
          priv->rhport.hport.devclass = NULL;
        }

      /* Re-Initialize Host for new Enumeration */

      priv->smstate   = SMSTATE_DETACHED;
      priv->connected = false;
      priv->change    = true;
      stm32_chan_freeall(priv);

      priv->rhport.hport.speed = USB_SPEED_FULL;
      priv->rhport.hport.funcaddr = 0;

      /* Notify any waiters that there is a change in the connection state */

      if (priv->pscwait)
        {
          nxsem_post(&priv->pscsem);
          priv->pscwait = false;
        }
    }
}

/****************************************************************************
 * Name: stm32_hc_in_irq
 *
 * Description:
 *   Handle IN channel interrupt (device-to-host transfers).
 *   Based on ST HAL HCD_HC_IN_IRQHandler pattern.
 *
 ****************************************************************************/

static void stm32_hc_in_irq(struct stm32_usbhost_s *priv, int chidx)
{
  struct stm32_chan_s *chan = &priv->chan[chidx];
  uint32_t chepval = stm32_getreg(STM32_USB_CHEP(chidx));
  uint32_t rx_status = chepval & USB_CHEP_RX_STRX_MASK;
  bool wakeup = false;

  if ((chepval & USB_CHEP_ERRRX) != 0)
    {
      chepval = stm32_getreg(STM32_USB_CHEP(chidx));
      uerr("ERRRX chidx=%d chepval=0x%08x rx_status=%d nak=%d\n",
           chidx, (unsigned int)chepval,
           (int)((chepval & USB_CHEP_RX_STRX_MASK) >>
           USB_CHEP_RX_STRX_SHIFT),
           (int)((chepval & USB_CHEP_NAK) != 0));

      /* Clear ERRRX (write 0) and VTRX (write 0) to acknowledge the CTR
       * interrupt. Preserve VTTX by writing 1.
       */

      chepval = (chepval & (0xffff7fff & USB_CHEP_REG_MASK) &
                 ~USB_CHEP_ERRRX) | USB_CHEP_VTTX;
      stm32_putreg(STM32_USB_CHEP(chidx), chepval);

      chan->result = EIO;
      chan->chreason = CHREASON_TXERR;
      stm32_chan_wakeup(priv, chan);
      return;
    }

  /* Check RX status for ACK/NAK/STALL
   * After successful transfer, status becomes USB_CHEP_RX_STRX_DIS (0x0)
   * meaning "ACK received, channel disabled".
   */

  if (rx_status == USB_CHEP_RX_STRX_DIS)
    {
      /* ACK - successful transfer, read data from PMA */

      volatile uint32_t *pbd;
      uint16_t count;
      bool transfer_complete;

      pbd = (volatile uint32_t *)(STM32_USBDRD_PMA_BASE +
                                  USB_PMA_RXBD_OFFSET(chidx));
      count = (*pbd >> USB_PMA_RXBD_COUNT_SHIFT) & 0x3ff;

