apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
      /* Clip to remaining buffer space */

      if (count > chan->buflen)
        {
          count = chan->buflen;
        }

      /* Read data from PMA using the address from the BD - this ensures we
       * read from wherever the hardware actually wrote the data.
       */

      if (count > 0 && chan->buffer != NULL)
        {
          stm32_pma_read(chan->buffer, chan->pmaaddr, count);
        }

      /* Accumulate bytes, advance buffer, reduce remaining */

      chan->xfrd += count;
      chan->buffer += count;
      chan->buflen -= count;

      /* Toggle DATA0/DATA1 for this packet */

      chan->indata1 ^= true;

      /* Check if transfer is complete:
       * - All requested bytes received (buflen == 0)
       * - Short packet received (count < maxpacket)
       * - Zero-length packet received (count == 0)
       */

      transfer_complete = (chan->buflen == 0) ||
                          (count < chan->maxpacket) ||
                          (count == 0);

      if (!transfer_complete && (chan->waiter || chan->callback))
        {
          /* Clear VTRX by writing 0 to it
           * (toggle bit, write 1 keeps, write 0 clears)
           */

          chepval = stm32_getreg(STM32_USB_CHEP(chidx));
          chepval = (chepval &
                    (0xffff7fff & USB_CHEP_REG_MASK)) | USB_CHEP_VTTX;
          stm32_putreg(STM32_USB_CHEP(chidx), chepval);

          /* More data expected - reactivate channel for next packet */

          stm32_transfer_start(priv, chidx);
          return;
        }
      else
        {
          /* Transfer complete - set success result */

          chan->result = OK;
          chan->chreason = CHREASON_XFRC;
          wakeup = true;
        }
    }
  else if (rx_status == USB_CHEP_RX_STRX_NAK)
    {
      /* NAK is normal flow control
       * If we have a waiter, just let hardware keep retrying indefinitely.
       * We will timeout in stm32_chan_wait
       * and cancel if the device never answers
       */

      if (!chan->waiter && !chan->callback)
        {
          /* No waiters on this. Cancel the transaction */

          stm32_set_chep_rx_status(priv, chan->chidx,
                                   USB_CHEP_RX_STRX_STALL);
        }
    }
  else if (rx_status == USB_CHEP_RX_STRX_STALL)
    {
      /* STALL - endpoint halted, disable channel */

      chan->result = EPERM;
      chan->chreason = CHREASON_STALL;

      /* Disable the channel */

      stm32_set_chep_rx_status(priv, chan->chidx, USB_CHEP_RX_STRX_DIS);
      wakeup = true;
    }

  /* Clear VTRX by writing 0 to it
   * (toggle bit, write 1 keeps, write 0 clears)
   */

  chepval = stm32_getreg(STM32_USB_CHEP(chidx));
  chepval = (chepval & (0xffff7fff & USB_CHEP_REG_MASK)) | USB_CHEP_VTTX;
  stm32_putreg(STM32_USB_CHEP(chidx), chepval);

  if (wakeup)
    {
      stm32_chan_wakeup(priv, chan);
    }
}

/****************************************************************************
 * Name: stm32_hc_out_irq
 *
 * Description:
 *   Handle OUT channel interrupt (host-to-device transfers including SETUP).
 *   Based on ST HAL HCD_HC_OUT_IRQHandler pattern.
 *
 ****************************************************************************/

static void stm32_hc_out_irq(struct stm32_usbhost_s *priv, int chidx)
{
  struct stm32_chan_s *chan = &priv->chan[chidx];
  uint32_t chepval = stm32_getreg(STM32_USB_CHEP(chidx));
  uint32_t tx_status = chepval & USB_CHEP_TX_STTX_MASK;
  bool wakeup = false;

  if ((chepval & USB_CHEP_ERRTX) != 0)
    {
      /* Clear error bit: write 0 to ERRTX to clear,
       * write 1 to VTRX/VTTX to preserve
       */

      chepval = stm32_getreg(STM32_USB_CHEP(chidx));
      chepval = (chepval & USB_CHEP_REG_MASK & ~USB_CHEP_ERRTX) |
                USB_CHEP_VTRX | USB_CHEP_VTTX;
      stm32_putreg(STM32_USB_CHEP(chidx), chepval);

      chan->result = EIO;
      chan->chreason = CHREASON_TXERR;
      stm32_chan_wakeup(priv, chan);
      return;
    }

  /* Check TX status for ACK/NAK/STALL
   * After successful transfer, status becomes USB_CHEP_TX_STTX_DIS (0x0)
   * meaning "ACK received, channel disabled".
   */

  if (tx_status == USB_CHEP_TX_STTX_DIS)
    {
      /* ACK - successful transfer of one packet */

      uint16_t sent_count;

      /* Calculate how much was sent (capped at maxpacket) */

      sent_count = (chan->buflen > chan->maxpacket) ?
                    chan->maxpacket : chan->buflen;

      /* Accumulate bytes, advance buffer, reduce remaining */

      chan->xfrd += sent_count;
      chan->buffer += sent_count;
      chan->buflen -= sent_count;

      /* Toggle DATA0/DATA1 */

      chan->outdata1 ^= true;

      /* Check if more data to send */

      if (chan->buflen > 0 && (chan->waiter || chan->callback))
        {
          /* More data to send.
           * prepare and restart channel without waking thread
           */

          stm32_transfer_start(priv, chidx);
        }
      else
        {
          /* All data sent - mark complete */

          chan->result = OK;
          chan->chreason = CHREASON_XFRC;
          wakeup = true;
        }
    }
  else if (((chepval & USB_CHEP_NAK) == USB_CHEP_NAK) ||
           (tx_status == USB_CHEP_TX_STTX_NAK))
    {
      /* NAK is normal flow control
       * If we have a waiter, just let hardware keep retrying indefinitely.
       * We will timeout in stm32_chan_wait and cancel
       * if the device never answers
       */

      /* Clear NAK if it was set */

      if ((chepval & USB_CHEP_NAK) != 0)
        {
          chepval = stm32_getreg(STM32_USB_CHEP(chidx));
          chepval = (chepval & USB_CHEP_REG_MASK & ~USB_CHEP_NAK) |
                    USB_CHEP_VTRX | USB_CHEP_VTTX;
          stm32_putreg(STM32_USB_CHEP(chidx), chepval);
        }

      if (!chan->waiter && !chan->callback)
        {
          /* No waiters on this. Cancel the transaction */

          stm32_set_chep_tx_status(priv, chan->chidx,
                                   USB_CHEP_TX_STTX_STALL);
        }
    }
  else if (tx_status == USB_CHEP_TX_STTX_STALL)
    {
      /* STALL - endpoint halted, disable channel */

      chan->result = EPERM;
      chan->chreason = CHREASON_STALL;
      wakeup = true;

      /* Disable the channel */

      stm32_set_chep_tx_status(priv, chan->chidx, USB_CHEP_TX_STTX_DIS);
    }

