apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
  /* Clear VTTX by writing 0 to it */

  chepval = stm32_getreg(STM32_USB_CHEP(chidx));
  chepval = (chepval & (0xffffff7f & USB_CHEP_REG_MASK)) | USB_CHEP_VTRX;
  stm32_putreg(STM32_USB_CHEP(chidx), chepval);

  if (wakeup)
    {
      stm32_chan_wakeup(priv, chan);
    }
}

/****************************************************************************
 * Name: stm32_usbdrd_interrupt
 *
 * Description:
 *   USB DRD interrupt handler.
 *   Dispatches channel transfer interrupts to IN/OUT handlers based on
 *   direction, following ST HAL pattern.
 *
 ****************************************************************************/

static int stm32_usbdrd_interrupt(int irq, void *context, void *arg)
{
  struct stm32_usbhost_s *priv = &g_usbhost;
  uint32_t istr;

  istr = stm32_getreg(STM32_USB_ISTR);

  /* Device connection/Disconnection. The STM32H5 has both USB_ISTR_DDISC
   * and USB_ISTR_RESET to detect a connected device. Use USB_ISTR_RESET
   * since it is signaled after 22 cycles (debounced)
   */

  if ((istr & USB_ISTR_RESET) != 0)
    {
      if ((istr & USB_ISTR_DCON_STAT) != 0)
        {
          stm32_gint_connected(priv);
        }
      else
        {
          stm32_gint_disconnected(priv);
        }

      stm32_putreg(STM32_USB_ISTR, ~USB_ISTR_RESET);
    }

  /* Device connection */

  if ((istr & USB_ISTR_DDISC) != 0)
    {
      /* Not used. USB_ISTR_RESET used instead */

      stm32_putreg(STM32_USB_ISTR, ~USB_ISTR_DDISC);
    }

  /* Correct transfer - dispatch to IN or OUT handler based on direction */

  if ((istr & USB_ISTR_CTR) != 0)
    {
      int chidx = istr & USB_ISTR_EPID_MASK;
      bool is_in = (istr & USB_ISTR_DIR) != 0;

      if (is_in)
        {
          stm32_hc_in_irq(priv, chidx);
        }
      else
        {
          /* STM32H562xx/563xx/573xx Errata:
           * During OUT transfers, the correct transfer interrupt (CTR) is
           * triggered a little before the last USB SRAM accesses have
           * completed. If the software responds quickly to the interrupt,
           * the full buffer contents may not be correct.
           * Software should ensure that a small delay is included before
           * accessing the SRAM contents. This delay should be 800 ns in
           * Full Speed mode and 6.4 μs in Low Speed mode.
           */

          up_udelay(1);

          stm32_hc_out_irq(priv, chidx);
        }
    }

  /* Error */

  if ((istr & USB_ISTR_ERR) != 0)
    {
      uerr("ERROR: USB error\n");
      stm32_putreg(STM32_USB_ISTR, ~USB_ISTR_ERR);
    }

  /* PMA overrun */

  if ((istr & USB_ISTR_PMAOVRN) != 0)
    {
      uerr("ERROR: PMA overrun\n");
      stm32_putreg(STM32_USB_ISTR, ~USB_ISTR_PMAOVRN);
    }

  /* Other interrupts - not used, just clear */

  if ((istr & USB_ISTR_WKUP) != 0)
    {
      stm32_putreg(STM32_USB_ISTR, ~USB_ISTR_WKUP);
    }

  if ((istr & USB_ISTR_SUSP) != 0)
    {
      stm32_putreg(STM32_USB_ISTR, ~USB_ISTR_SUSP);
    }

  if ((istr & USB_ISTR_SOF) != 0)
    {
      stm32_putreg(STM32_USB_ISTR, ~USB_ISTR_SOF);
    }

  if ((istr & USB_ISTR_ESOF) != 0)
    {
      stm32_putreg(STM32_USB_ISTR, ~USB_ISTR_ESOF);
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_wait
 *
 * Description:
 *   Wait for device connection/disconnection
 *
 ****************************************************************************/

static int stm32_wait(struct usbhost_connection_s *conn,
                         struct usbhost_hubport_s **hport)
{
  struct stm32_usbhost_s *priv = &g_usbhost;
  struct usbhost_hubport_s *connport;
  irqstate_t flags;
  int ret;

  flags = enter_critical_section();

  for (; ; )
    {
      if (priv->change)
        {
          priv->change = false;

          connport = &priv->rhport.hport;
          connport->connected = priv->connected;

          *hport = connport;

          leave_critical_section(flags);

          uinfo("RHport Connected: %s\n",
                connport->connected ? "YES" : "NO");
          return OK;
        }

#ifdef CONFIG_USBHOST_HUB
      /* Is a device connected to an external hub? */

      if (priv->hport)
        {
          /* Yes.. return the external hub port */

          connport = (struct usbhost_hubport_s *)priv->hport;
          priv->hport = NULL;

          *hport = connport;
          leave_critical_section(flags);

          uinfo("Hub port Connected: %s\n",
                connport->connected ? "YES" : "NO");
          return OK;
        }
#endif

      priv->pscwait = true;
      ret = nxsem_wait(&priv->pscsem);
      if (ret < 0)
        {
          leave_critical_section(flags);
          return ret;
        }
    }
}

/****************************************************************************
 * Name: stm32_rh_enumerate
 *
 * Description:
 *   Enumerate the root hub
 *
 ****************************************************************************/

static int stm32_rh_enumerate(struct stm32_usbhost_s *priv,
                                 struct usbhost_connection_s *conn,
                                 struct usbhost_hubport_s *hport)
{
  uint32_t istr;
  int ret;

  DEBUGASSERT(hport != NULL && hport->port == 0);

  /* Are we connected? */

  if (!priv->connected)
    {
      return -ENODEV;
    }

  /* USB 2.0 spec says at least 50ms delay before port reset */

  nxsched_usleep(50 * 1000);

  /* Reset the port */

  stm32_portreset(priv);

  /* Check for low-speed device */

  istr = stm32_getreg(STM32_USB_ISTR);
  if ((istr & USB_ISTR_LS_DCONN) != 0)
    {
      hport->speed = USB_SPEED_LOW;
    }
  else
    {
      hport->speed = USB_SPEED_FULL;
    }

  /* Allocate control endpoint */

  ret = stm32_ctrlchan_alloc(priv, 0, 0, hport->speed, &priv->ep0);
  if (ret < 0)
    {
      uerr("ERROR: Failed to allocate EP0: %d\n", ret);
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  uinfo("Enumerated device at %s speed\n",
        hport->speed == USB_SPEED_LOW ? "low" : "full");

  return ret;
}

/****************************************************************************
 * Name: stm32_enumerate
 *
 * Description:
 *   Enumerate a connected device
 *
 ****************************************************************************/

static int stm32_enumerate(struct usbhost_connection_s *conn,
                              struct usbhost_hubport_s *hport)
{
  struct stm32_usbhost_s *priv = &g_usbhost;
  int ret;

  DEBUGASSERT(hport != NULL);

  /* If this is the root hub port */

#ifdef CONFIG_USBHOST_HUB
  if (ROOTHUB(hport))
#endif
    {
      ret = stm32_rh_enumerate(priv, conn, hport);
      if (ret < 0)
        {
          return ret;
        }
    }

