apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
  /* Perform standard enumeration */

  ret = usbhost_enumerate(hport, &hport->devclass);

  /* The enumeration may fail either because of some HCD interfaces failure
   * or because the device class is not supported.  In either case, we just
   * need to perform the disconnection operation and make ready for a new
   * enumeration.
   */

  if (ret < 0)
    {
      /* Return to the disconnected state */

      uerr("ERROR: Enumeration failed: %d\n", ret);
      stm32_gint_disconnected(priv);
    }

  return ret;
}

/****************************************************************************
 * Name: stm32_ep0configure
 *
 * Description:
 *   Configure endpoint 0
 *
 ****************************************************************************/

static int stm32_ep0configure(struct usbhost_driver_s *drvr,
                                 usbhost_ep_t ep0, uint8_t funcaddr,
                                 uint8_t speed, uint16_t maxpacketsize)
{
  struct stm32_usbhost_s *priv = (struct stm32_usbhost_s *)drvr;
  struct stm32_ctrlinfo_s *ep0info = (struct stm32_ctrlinfo_s *)ep0;
  struct stm32_chan_s *chan;
  int ret;

  DEBUGASSERT(drvr != NULL && ep0info != NULL);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* Configure IN channel */

  chan = &priv->chan[ep0info->inndx];
  chan->funcaddr = funcaddr;
  chan->speed = speed;
  chan->maxpacket = maxpacketsize;
  stm32_chan_configure(priv, ep0info->inndx);

  /* Configure OUT channel */

  chan = &priv->chan[ep0info->outndx];
  chan->funcaddr = funcaddr;
  chan->speed = speed;
  chan->maxpacket = maxpacketsize;
  stm32_chan_configure(priv, ep0info->outndx);

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: stm32_epalloc
 *
 * Description:
 *   Allocate an endpoint
 *
 ****************************************************************************/

static int stm32_epalloc(struct usbhost_driver_s *drvr,
                            const struct usbhost_epdesc_s *epdesc,
                            usbhost_ep_t *ep)
{
  struct stm32_usbhost_s *priv = (struct stm32_usbhost_s *)drvr;
  int ret;

  DEBUGASSERT(drvr != NULL && epdesc != NULL && ep != NULL);
  DEBUGASSERT(priv->connected);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (epdesc->xfrtype == USB_EP_ATTR_XFER_CONTROL)
    {
      ret = stm32_ctrlep_alloc(priv, epdesc, ep);
    }
  else
    {
      ret = stm32_xfrep_alloc(priv, epdesc, ep);
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: stm32_epfree
 *
 * Description:
 *   Free an endpoint
 *
 ****************************************************************************/

static int stm32_epfree(struct usbhost_driver_s *drvr, usbhost_ep_t ep)
{
  struct stm32_usbhost_s *priv = (struct stm32_usbhost_s *)drvr;
  int ret;

  DEBUGASSERT(drvr != NULL);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* A single channel is represent by an index in the range of 0 to
   * STM32_NHOST_CHANNELS.  Otherwise, the ep must be a pointer to
   * an allocated control endpoint structure.
   */

  if ((uintptr_t)ep < STM32_NHOST_CHANNELS)
    {
      /* Halt the channel and mark the channel available */

      stm32_chan_free(priv, (int)ep);
    }
  else
    {
      /* Halt both control channel and mark the channels available */

      struct stm32_ctrlinfo_s *ctrlep =
        (struct stm32_ctrlinfo_s *)ep;

      stm32_chan_free(priv, ctrlep->inndx);
      stm32_chan_free(priv, ctrlep->outndx);

      /* And free the control endpoint container */

      kmm_free(ctrlep);
    }

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: stm32_alloc
 *
 * Description:
 *   Allocate a request/descriptor buffer
 *
 ****************************************************************************/

static int stm32_alloc(struct usbhost_driver_s *drvr,
                          uint8_t **buffer, size_t *maxlen)
{
  uint8_t *alloc;

  DEBUGASSERT(drvr && buffer && maxlen);

  alloc = kmm_malloc(CONFIG_STM32_USBDRD_DESCSIZE);
  if (!alloc)
    {
      return -ENOMEM;
    }

  *buffer = alloc;
  *maxlen = CONFIG_STM32_USBDRD_DESCSIZE;
  return OK;
}

/****************************************************************************
 * Name: stm32_free
 *
 * Description:
 *   Free a request/descriptor buffer
 *
 ****************************************************************************/

static int stm32_free(struct usbhost_driver_s *drvr, uint8_t *buffer)
{
  DEBUGASSERT(drvr && buffer);
  kmm_free(buffer);
  return OK;
}

/****************************************************************************
 * Name: stm32_ioalloc
 *
 * Description:
 *   Allocate an I/O buffer
 *
 ****************************************************************************/

static int stm32_ioalloc(struct usbhost_driver_s *drvr,
                            uint8_t **buffer, size_t buflen)
{
  uint8_t *alloc;

  DEBUGASSERT(drvr && buffer && buflen > 0);

  alloc = kmm_malloc(buflen);
  if (!alloc)
    {
      return -ENOMEM;
    }

  *buffer = alloc;
  return OK;
}

/****************************************************************************
 * Name: stm32_iofree
 *
 * Description:
 *   Free an I/O buffer
 *
 ****************************************************************************/

static int stm32_iofree(struct usbhost_driver_s *drvr, uint8_t *buffer)
{
  DEBUGASSERT(drvr && buffer);
  kmm_free(buffer);
  return OK;
}

/****************************************************************************
 * Name: stm32_ctrlin
 *
 * Description:
 *   Control IN transfer
 *
 ****************************************************************************/

static int stm32_ctrlin(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                           const struct usb_ctrlreq_s *req, uint8_t *buffer)
{
  struct stm32_usbhost_s *priv = (struct stm32_usbhost_s *)drvr;
  struct stm32_ctrlinfo_s *ep0info = (struct stm32_ctrlinfo_s *)ep0;
  uint16_t buflen;
  int retries;
  int ret;

  DEBUGASSERT(drvr != NULL && ep0info != NULL && req != NULL);

  buflen = stm32_getle16(req->len);

  uinfo("type=%02x req=%02x value=%04x index=%04x len=%04x\n",
        req->type, req->req,
        stm32_getle16(req->value),
        stm32_getle16(req->index),
        buflen);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  for (retries = 0; retries < STM32_RETRY_COUNT; retries++)
    {
      /* Send SETUP */

      ret = stm32_ctrl_sendsetup(priv, ep0info, req);
      if (ret < 0)
        {
          uerr("ERROR: SETUP failed: %d\n", ret);
          continue;
        }

      /* Receive data */

      if (buflen > 0)
        {
          ret = stm32_ctrl_recvdata(priv, ep0info, buffer, buflen);
          if (ret < 0)
            {
              uerr("ERROR: Data IN failed: %d\n", ret);
              continue;
            }
        }

