apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
      /* Send status OUT */

      ret = stm32_ctrl_senddata(priv, ep0info, NULL, 0);
      if (ret < 0)
        {
          uerr("ERROR: Status OUT failed: %d\n", ret);
          continue;
        }

      /* Success */

      nxmutex_unlock(&priv->lock);
      return OK;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: stm32_ctrlout
 *
 * Description:
 *   Control OUT transfer
 *
 ****************************************************************************/

static int stm32_ctrlout(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                            const struct usb_ctrlreq_s *req,
                            const uint8_t *buffer)
{
  struct stm32_usbhost_s *priv = (struct stm32_usbhost_s *)drvr;
  struct stm32_ctrlinfo_s *ep0info = (struct stm32_ctrlinfo_s *)ep0;
  uint16_t buflen;
  int retries;
  int ret;

  DEBUGASSERT(drvr != NULL && ep0info != NULL && req != NULL);

  buflen = stm32_getle16(req->len);

  uinfo("type=%02x req=%02x value=%04x index=%04x len=%04x\n",
        req->type, req->req,
        stm32_getle16(req->value),
        stm32_getle16(req->index),
        buflen);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  for (retries = 0; retries < STM32_RETRY_COUNT; retries++)
    {
      /* Send SETUP */

      ret = stm32_ctrl_sendsetup(priv, ep0info, req);
      if (ret < 0)
        {
          uerr("ERROR: SETUP failed: %d\n", ret);
          continue;
        }

      /* Send data */

      if (buflen > 0)
        {
          ret = stm32_ctrl_senddata(priv, ep0info,
                                       (uint8_t *)buffer, buflen);
          if (ret < 0)
            {
              uerr("ERROR: Data OUT failed: %d\n", ret);
              continue;
            }
        }

      /* Receive status IN */

      ret = stm32_ctrl_recvdata(priv, ep0info, NULL, 0);
      if (ret < 0)
        {
          uerr("ERROR: Status IN failed: %d\n", ret);
          continue;
        }

      nxmutex_unlock(&priv->lock);
      return OK;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: stm32_transfer
 *
 * Description:
 *   Bulk/interrupt transfer
 *
 ****************************************************************************/

static ssize_t stm32_transfer(struct usbhost_driver_s *drvr,
                                 usbhost_ep_t ep, uint8_t *buffer,
                                 size_t buflen)
{
  struct stm32_usbhost_s *priv = (struct stm32_usbhost_s *)drvr;
  unsigned int chidx = (unsigned int)ep;
  ssize_t nbytes;
  int ret;

  DEBUGASSERT(priv && buffer && chidx < STM32_NHOST_CHANNELS);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->chan[chidx].in)
    {
      nbytes = stm32_in_transfer(priv, chidx, buffer, buflen);
    }
  else
    {
      nbytes = stm32_out_transfer(priv, chidx, buffer, buflen);
      if (nbytes > 0 && (buflen % priv->chan[chidx].maxpacket == 0))
        {
          /* For OUT transfers that are a multiple of maxpacket,
           * we need to send a zero-length packet to complete the transfer.
           */

          int zlp_ret = stm32_out_transfer(priv, chidx, NULL, 0);
          if (zlp_ret < 0)
            {
              uerr("ERROR: Failed to send ZLP: %d\n", zlp_ret);
              nbytes = zlp_ret;
            }
        }
    }

  nxmutex_unlock(&priv->lock);
  return nbytes;
}

/****************************************************************************
 * Name: stm32_asynch
 *
 * Description:
 *   Async transfer
 *
 ****************************************************************************/

#ifdef CONFIG_USBHOST_ASYNCH
static int stm32_asynch(struct usbhost_driver_s *drvr, usbhost_ep_t ep,
                           uint8_t *buffer, size_t buflen,
                           usbhost_asynch_t callback, void *arg)
{
  struct stm32_usbhost_s *priv = (struct stm32_usbhost_s *)drvr;
  unsigned int chidx = (unsigned int)ep;
  struct stm32_chan_s *chan;
  int ret;

  DEBUGASSERT(priv && buffer && chidx < STM32_NHOST_CHANNELS);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  chan = &priv->chan[chidx];
  chan->waiter = false;
  chan->callback = callback;
  chan->arg = arg;
  chan->buffer = buffer;
  chan->buflen = buflen;
  chan->xfrd = 0;

  stm32_transfer_start(priv, chidx);

  nxmutex_unlock(&priv->lock);
  return OK;
}
#endif

/****************************************************************************
 * Name: stm32_cancel
 *
 * Description:
 *   Cancel a pending transfer
 *
 ****************************************************************************/

static int stm32_cancel(struct usbhost_driver_s *drvr, usbhost_ep_t ep)
{
  struct stm32_usbhost_s *priv = (struct stm32_usbhost_s *)drvr;
  unsigned int chidx = (unsigned int)ep;
  struct stm32_chan_s *chan;
  irqstate_t flags;

  DEBUGASSERT(priv && chidx < STM32_NHOST_CHANNELS);

  chan = &priv->chan[chidx];

  flags = enter_critical_section();

  if (chan->in)
    {
      stm32_set_chep_rx_status(priv, chidx, USB_CHEP_RX_STRX_DIS);
    }
  else
    {
      stm32_set_chep_tx_status(priv, chidx, USB_CHEP_TX_STTX_DIS);
    }

  chan->result = ECANCELED;
  chan->chreason = CHREASON_CANCELLED;
  stm32_chan_wakeup(priv, chan);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: stm32_connect
 *
 * Description:
 *   Hub port connection notification
 *
 ****************************************************************************/

#ifdef CONFIG_USBHOST_HUB
static int stm32_connect(struct usbhost_driver_s *drvr,
                            struct usbhost_hubport_s *hport, bool connected)
{
  struct stm32_usbhost_s *priv = (struct stm32_usbhost_s *)drvr;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL && hport != NULL);

  /* Set the connected/disconnected flag */

