apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
  hport->connected = connected;
  uinfo("Hub port %d connected: %s\n",
        hport->port, connected ? "YES" : "NO");

  /* Report the connection event */

  flags = enter_critical_section();
  priv->hport = hport;
  if (priv->pscwait)
    {
      priv->pscwait = false;
      nxsem_post(&priv->pscsem);
    }

  leave_critical_section(flags);
  return OK;
}
#endif

/****************************************************************************
 * Name: stm32_disconnect
 *
 * Description:
 *   Device disconnection notification
 *
 ****************************************************************************/

static void stm32_disconnect(struct usbhost_driver_s *drvr,
                                struct usbhost_hubport_s *hport)
{
  DEBUGASSERT(hport != NULL);
  hport->devclass = NULL;
}

/****************************************************************************
 * Name: stm32_portreset
 *
 * Description:
 *   Reset the USB port
 *
 ****************************************************************************/

static void stm32_portreset(struct stm32_usbhost_s *priv)
{
  uint32_t regval;

  /* Force USB reset */

  regval = stm32_getreg(STM32_USB_CNTR);
  regval |= USB_CNTR_FRES;
  stm32_putreg(STM32_USB_CNTR, regval);

  /* Wait for reset */

  nxsched_usleep(STM32_RESET_DELAY * 1000);

  /* Release reset */

  regval &= ~USB_CNTR_FRES;
  stm32_putreg(STM32_USB_CNTR, regval);

  /* Wait for device to be ready */

  nxsched_usleep(30 * 1000);
}

/****************************************************************************
 * Name: stm32_host_initialize
 *
 * Description:
 *   Initialize the USB host hardware
 *
 ****************************************************************************/

static void stm32_host_initialize(struct stm32_usbhost_s *priv)
{
  uint32_t regval;

  UNUSED(priv);

  /* Clear all pending interrupts */

  stm32_putreg(STM32_USB_ISTR, 0);

  /* Disable all interrupts initially (preserve HOST bit) */

  regval = stm32_getreg(STM32_USB_CNTR);
  regval &= ~(USB_CNTR_CTRM | USB_CNTR_PMAOVRN | USB_CNTR_ERRM |
              USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_RESETM |
              USB_CNTR_SOFM | USB_CNTR_ESOFM | USB_CNTR_L1REQ |
              USB_CNTR_DDISCM | USB_CNTR_THR512M);
  stm32_putreg(STM32_USB_CNTR, regval);

  /* Clear pending interrupts again */

  stm32_putreg(STM32_USB_ISTR, 0);

  /* Set pull-down on D+ for device detection (host mode) */

  regval = stm32_getreg(STM32_USB_BCDR);
  regval |= USB_BCDR_DPPD;
  stm32_putreg(STM32_USB_BCDR, regval);

  /* Enable host mode interrupts:
   * - CTRM: Correct transfer
   * - PMAOVRN: PMA overrun - not used
   * - ERRM: Error
   * - WKUPM: Wakeup - not used
   * - SUSPM: Suspend - not used
   * - RESETM/DCON: Device connection (in host mode, RESETM serves as DCON)
   * - SOFM: Start of frame - not used
   * - ESOFM: Expected start of frame - not used
   * - L1REQ: LPM L1 request - not used
   */

  regval = stm32_getreg(STM32_USB_CNTR);
  regval |= (USB_CNTR_CTRM | USB_CNTR_ERRM | USB_CNTR_RESETM);
  stm32_putreg(STM32_USB_CNTR, regval);
}

/****************************************************************************
 * Name: stm32_sw_initialize
 *
 * Description:
 *   Initialize driver software state
 *
 ****************************************************************************/

static void stm32_sw_initialize(struct stm32_usbhost_s *priv)
{
  struct usbhost_driver_s *drvr;
  struct usbhost_hubport_s *hport;
  int i;

  /* Initialize driver interface */

  drvr = &priv->drvr;
  drvr->ep0configure = stm32_ep0configure;
  drvr->epalloc = stm32_epalloc;
  drvr->epfree = stm32_epfree;
  drvr->alloc = stm32_alloc;
  drvr->free = stm32_free;
  drvr->ioalloc = stm32_ioalloc;
  drvr->iofree = stm32_iofree;
  drvr->ctrlin = stm32_ctrlin;
  drvr->ctrlout = stm32_ctrlout;
  drvr->transfer = stm32_transfer;
#ifdef CONFIG_USBHOST_ASYNCH
  drvr->asynch = stm32_asynch;
#endif
  drvr->cancel = stm32_cancel;
#ifdef CONFIG_USBHOST_HUB
  drvr->connect = stm32_connect;
#endif
  drvr->disconnect = stm32_disconnect;

  /* Initialize root hub port */

  hport = &priv->rhport.hport;
  hport->drvr = drvr;
#ifdef CONFIG_USBHOST_HUB
  hport->parent = NULL;
#endif
  hport->ep0 = &priv->ep0;
  hport->port = 0;
  hport->speed = USB_SPEED_FULL;

  /* Initialize function address generation logic */

  usbhost_devaddr_initialize(&priv->devgen);
  priv->rhport.pdevgen = &priv->devgen;

  /* Initialize state */

  priv->smstate = SMSTATE_DETACHED;
  priv->connected = false;
  priv->change = false;
  priv->pscwait = false;

  /* Initialize PMA allocation - all buffers available */

  priv->pma_bufavail = STM32_PMA_BUFFER_ALLSET;

  /* Initialize channels */

  for (i = 0; i < STM32_NHOST_CHANNELS; i++)
    {
      priv->chan[i].chidx = i;
      priv->chan[i].inuse = false;
      priv->chan[i].pmabufno = STM32_PMA_BUFFER_NONE;
      nxsem_init(&priv->chan[i].waitsem, 0, 0);
    }
}

/****************************************************************************
 * Name: stm32_hw_initialize
 *
 * Description:
 *   Initialize the USB hardware
 *
 ****************************************************************************/

static int stm32_hw_initialize(struct stm32_usbhost_s *priv)
{
  uint32_t regval;
  int ret;

  /* Enable VDDUSB supply - required for USB PHY operation */

  putreg32(PWR_USBSCR_USB33DEN, STM32_PWR_USBSCR);

  /* Wait for VDDUSB to be ready */

  while ((getreg32(STM32_PWR_VMSR) & PWR_VMSR_USB33RDY) == 0)
    {
    }

  /* Enable and validate USB supply */

  putreg32(PWR_USBSCR_USB33DEN | PWR_USBSCR_USB33SV, STM32_PWR_USBSCR);

  /* Configure USB GPIO pins (PA11=D-, PA12=D+) */

  stm32_configgpio(GPIO_USB_DM);
  stm32_configgpio(GPIO_USB_DP);

  /* Enable USB clock via RCC */

  regval = getreg32(STM32_RCC_APB2ENR);
  regval |= RCC_APB2ENR_USBEN;
  putreg32(regval, STM32_RCC_APB2ENR);

  /* Wait for USB clock to stabilize */

  nxsched_usleep(2000);

  /* Perform USB core reset sequence:
   * 1. Disable host mode
   * 2. Set USBRST to reset the core
   */

  regval = stm32_getreg(STM32_USB_CNTR);
  regval &= ~USB_CNTR_HOST;
  regval |= USB_CNTR_FRES;  /* Force USB reset */
  stm32_putreg(STM32_USB_CNTR, regval);

  /* Clear all pending interrupts */

  stm32_putreg(STM32_USB_ISTR, 0);

  /* Exit power-down mode and release reset:
   * Clear PDWN to enable the analog transceiver
   * Clear FRES to release the USB reset
   */

  regval = stm32_getreg(STM32_USB_CNTR);
  regval &= ~(USB_CNTR_PDWN | USB_CNTR_FRES);
  stm32_putreg(STM32_USB_CNTR, regval);

  /* Wait for analog circuits to stabilize (tSTARTUP) */

  nxsched_usleep(1000);

  /* Set host mode */

  regval = stm32_getreg(STM32_USB_CNTR);
  regval |= USB_CNTR_HOST;
  stm32_putreg(STM32_USB_CNTR, regval);

  /* Initialize host mode (interrupts, pull-downs, etc.) */

  stm32_host_initialize(priv);

  /* Attach interrupt handler */

