apache/nuttx/arch/arm/src/stm32h5/stm32_usbdrdhost.c
  ret = irq_attach(STM32_IRQ_USB_FS, stm32_usbdrd_interrupt, priv);
  if (ret < 0)
    {
      uerr("ERROR: Failed to attach IRQ: %d\n", ret);
      return ret;
    }

  /* Enable interrupt */

  up_enable_irq(STM32_IRQ_USB_FS);

  /* Enable VBUS drive */

  stm32_usbdrdhost_vbusdrive(0, true);

  uinfo("USB Host initialized\n");

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_usbdrdhost_initialize
 *
 * Description:
 *   Initialize USB host controller
 *
 ****************************************************************************/

struct usbhost_connection_s *stm32_usbdrdhost_initialize(void)
{
  struct stm32_usbhost_s *priv = &g_usbhost;
  int ret;

  uinfo("Initializing USB DRD host controller\n");

  /* Initialize software state */

  stm32_sw_initialize(priv);

  /* Initialize hardware */

  ret = stm32_hw_initialize(priv);
  if (ret < 0)
    {
      uerr("ERROR: Hardware initialization failed: %d\n", ret);
      return NULL;
    }

  return &g_usbconn;
}

/****************************************************************************
 * Name: stm32_usbdrdhost_vbusdrive
 *
 * Description:
 *   Control VBUS power
 *   This is a weak function that should be overridden by board-specific code
 *
 ****************************************************************************/

__attribute__((weak))
void stm32_usbdrdhost_vbusdrive(int port, bool enable)
{
  /* Default implementation - do nothing.
   * Board-specific code should override this to control VBUS power.
   */

  uinfo("VBUS drive port=%d enable=%d (default - no-op)\n", port, enable);
}

#endif /* CONFIG_USBHOST && CONFIG_STM32_USBFS_HOST */
